# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.

# Пример:
# - 6782 -> 23
# - 0,56 -> 11

# num = float(input('Enter any real number: '))

# num_int = int(str(num).replace('.', ''))
# sum = 0

# while num_int > 0:
#     cut_digit = num_int % 10
#     sum += cut_digit
#     num_int //= 10

# print(sum)
